#include<stdio.h>

int lab05(a, b)
{
   int i, max = 0;//Задаємо макісмальне число
   
   while(a > b)//Запуск циклу для перевірки чисел у встановленому діапазоні
   {
       b++;
       i = 2;
       while(b%i != 0)//Запуск циклу для того, щоб дізнатися число просте чи ні 
       {
           i++;
       }
       if(b == i && b > max)
       {
          max = b;      
       }      
   }
   return 0;
}

int lab06(k)
{
    //Масив А в який записуватимемо щасливі квитки.
    //Задаємо змінні sum1 і sum2 в яких буде зберігатися суми першої і другої пари чисел. 
    //Змінні n1, n2, n3, n4 зберігатимуть по одному числу з номера квитка. 
    //Змінна n – це кількість щасливих квитків.
    int A[9999],sum1,sum2,n1,n2,n3,n4,n = 0,i;
    

    //Цикл перевіряє всі квитки від k до 9999
    while( k <= 9999)
    {
        //Розбиваємо номер квитка на 4 числа
        n1 = k/1000;
        n2 = (k/100)%10;
        n3 = (k/10)%10;
        n4 = k%10;
        
        //Дізнаємось суму першої пари чисел і другої
        sum1 = n1 + n2;
        sum2 = n3 + n4;
        
        //Якщо сума першої пари дорівнює сумі другої, то записуємо цей квиток у масив і додаємо 1 до кількості щасливих квитків(n).
        if(sum1 == sum2)
        {
          A[n] = k;
          n++;
        }
        
        k++;
    }
    return 0;    
}
